Revit 2027 API
ComboBox.Current Property
Gets or sets the current checked ComboBox member of the ComboBox.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ComboBoxMember Current { get; set; }
Public Property Current As ComboBoxMember
	Get
	Set
public:
property ComboBoxMember^ Current {
	ComboBoxMember^ get ();
	void set (ComboBoxMember^ value);
}
member Current : ComboBoxMember with get, set
Property Value
ComboBoxMember
Exceptions
Exception | Condition
ArgumentNullException | Thrown when trying to set this property to null.
ArgumentException | Thrown when trying to set this property to a button not in this ComboBox.
Remarks
 The default value is the first ComboBox member added to the ComboBox.
See Also
Reference
ComboBox Class
Autodesk.Revit.UI Namespace